stressTest.yaml
config:
    target: "http://localhost:3000"
    phases:
      - duration: 60
        arrivalRate: 5
        name: Warm up
      - duration: 120
        arrivalRate: 5
        rampTo: 50
        name: Ramp up load
      - duration: 60
        arrivalRate: 50
        name: Sustained load
    payload:
      path: "ids.csv"
      fields:
        - id

scenarios:
  - name: "GET Reviews"
    flow:
    - loop:
      - get:
          url: "/reviews?product_id={{ id }}"