stressTest.yaml
config:
    target: "http://localhost:3000"
    http:
      pool: 20
    phases:
      - duration: 30
        arrivalRate: 1
        name: Warm up
      - duration: 60
        arrivalRate: 10
        rampTo: 100
        name: Ramp up load (10)
      - duration: 60
        arrivalRate: 100
        rampTo: 100
        name: Ramp up load (100)
      - duration: 60
        arrivalRate: 1000
        rampTo: 1000
        name: Ramp up load (1000)
    payload:
      path: "ids.csv"
      fields:
        - id

scenarios:
  - name: "GET Reviews"
    flow:
    - loop:
      - get:
          url: "/reviews?product_id={{ id }}"
  - name: "GET Review Meta Data"
    flow:
    - loop:
      - get:
          url: "/reviews/meta?product_id={{ id }}"